Repository: ESUCC/Maximd
Catalog: application/translation/form010/page1.tmx
Source language: es
Languages: en

source: Fecha de notificación
en: Date Notice

source: Agregar informe
en: Add Report

source: Borrar informe
en: Delete Report

source: Objetivo
en: Goal

source: Puntos de referencia o estándares
en: Benchmarks

source: Horario
en: Schedule

source: Procedimiento de la evaluación
en: Evaluation Procedure

source: Medición del progreso
en: Progress Measurement

source: Suficiente
en: Sufficient

source: Sí
en: Yes

source: Comentarios
en: Comments

source: Lista de gráficos
en: Chart List

source: Escala
en: Scale

source: Muy grande
en: Very Large

source: Pequeño
en: Small

source: Mediano
en: Medium

source: Grande
en: Large

source: Se cumplió el objetivo
en: Goal Met

source: Hubo progreso pero no se cumplió el objetivo
en: Progress Made, Goal Not Met

source: Poco o ningún progreso
en: Little or No Progress

source: Otro, especifique
en: Other specify

source: Seleccione para eliminar el renglón
en: Check to remove row

source: Si otro, proporcionar explique
en: If other, explain

source: El progreso del objetivo
en: Goal Progress

source: …Elija
en: ...Choose

source: A- 6 Semanas
en: A - 6 Weeks

source: B- 9 Semanas
en: B - 9 Weeks

source: C- Semestre
en: C - Semester

source: D- Otro
en: D - Other

source: Observaciones del maestro
en: Teacher Observation

source: Despempeño en escritura
en: Written Performance

source: Desempeño oral
en: Oral Performance

source: Pruebas con referencia a criterio
en: Criterion Reference Test

source: Informe de los padres
en: Parent Report

source: Tiempo de muestreo
en: Time Sample

source: Boletas de calificaciones
en: Report Cards
